# /Users/morifen/github/scripts/brew/10-essential/Brewfile
# https://github.com/marcbernardoni/scripts/blob/main/brew/10-essential/Brewfile

brew "expect"              	# Program that can automate interactive applications
brew "mtr"                 	# 'traceroute' and 'ping' in a single tool
brew "smartmontools"       	# SMART hard drive monitoring
brew "tcptraceroute"       	# Traceroute implementation using TCP packets
brew "telnet"              	# User interface to the TELNET protocol
brew "onedrive"			# Folder synchronization with OneDrive

cask "betterdisplay" 		# Display management tool
cask "google-cloud-sdk"		# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-drive"		# Client for the Google Drive storage service
cask "windows-app"		# Connect to Windows
cask "raycast"			# Control your tools with a few keystrokes
cask "setapp"			# Collection of apps available by subscription
cask "obs"			# Open-source software for live streaming and screen recording
cask "discord"			# Voice and text chat software
cask "postman"			# Collaboration platform for API development
cask "steam"			# Video game digital distribution service
cask "porting-kit"		# Install games and apps compiled for Microsoft Windows
# cask "element"		# Matrix collaboration client
